README.org
* Emacs Configuration

  A relatively minimal Emacs configuration.

** init.el - the user configuration
   
*** Heavy-handed additions

   - The [[https://github.com/abo-abo/swiper][ivy/counsel/swiper]] narrowing suite, using [[https://github.com/raxod502/prescient.el][prescient]] as a backend to sort matches;

   - Autocompletion with [[https://company-mode.github.io/][company]];

   - Support for Microsoft's Language Server Protocol, and its Emacs interface [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]]. Configured backends: [[https://github.com/MaskRay/emacs-ccls][ccls]] for C/C++ and the [[https://github.com/python-lsp/python-lsp-server][Python LSP Server]] for Python;

   - Emacs Speaks Statistics ([[https://ess.r-project.org/][ESS]]), the R-Studio quasi-replacement.

  
*** Minor additions

    - [[https://github.com/emacs-dashboard/emacs-dashboard][dashboard]] as a quick-access front page;

    - [[https://github.com/justbur/emacs-which-key][which-key]] for real-time keybinding suggestions;

    - the [[https://github.com/abo-abo/avy][avy]] visual text-jumping package.

** root-init.el - the root-user terminal configuration

   This init file is a simple lightweight terminal configuration. The use case I had in mind was a customization suitable for the root user.
   As such, it is self-contained: it only relies on the packages already included with the GNU Emacs installation.
   It should be copied or linked as ~/root/.emacs.d/init.el~.

** Future plans
   
  I will probably include LaTeX IDE features (and =pdf-tools=) in the near future.
